# Ultralytics YOLO 泅, AGPL-3.0 license
# YOLOv8 object detection model with P2 - P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

"""
EFAM	        Layers 6/8 in the backbone     Replace the C2f module to enhance local and global feature extraction (P4/P5 layers)
ETA	            Layer 10 in the backbone	   Apply triple attention at the end of the backbone to improve the spatial positioning ability of small objects
FSFDown	        Layer 11 in the head	       P2竊単3 downsampling, retaining high - frequency details
BiFPN (Fusion)	Layers 15/18/23 in the head	   Bidirectional feature fusion, optimizing cross - scale information interaction
WIoU v3 Loss	Detect layer	               Not directly shown, implemented through the Detect layer call (integrated at the code level)
"""
# Parameters
nc: 80 # Number of classes
scales: # Model compound scaling constants, i.e., 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] #  Nano model
  s: [0.33, 0.50, 1024] #  Small model
  m: [0.67, 0.75, 768] #  Medium model
  l: [1.00, 1.00, 512] #  Large model
  x: [1.00, 1.25, 512] #  Extra - large model
fusion_mode: bifpn # Use BiFPN as the feature fusion method
node_mode: C2f # Use C2f as the basic module (can be replaced with EFAM)
head_channel: 256 # Number of channels in the detection head

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 - P1/2 Initial convolutional layer
  - [-1, 1, Conv, [128, 3, 2]] # 1 - P2/4 Downsample to 4x
  - [-1, 3, C2f, [128, True]] # 2 - P2/4 Basic feature extraction
  - [-1, 1, Conv, [256, 3, 2]] # 3 - P3/8 Downsample to 8x
  - [-1, 6, C2f, [256, True]] # 4 - P3/8 Multi - layer feature extraction
  - [-1, 1, Conv, [512, 3, 2]] # 5 - P4/16 Downsample to 16x
  - [-1, 6, EFAM, [512, 0.5]] # 6 - P4/16 Enhanced Feature Aggregation Module (PSSA r = 0.5)
  - [-1, 1, Conv, [1024, 3, 2]] # 7 - P5/32 Downsample to 32x
  - [-1, 3, EFAM, [1024, 0.25]] # 8 - P5/32 Enhanced Feature Aggregation Module (PSSA r = 0.25)
  - [-1, 1, SPPF, [1024, 5]] # 9 - P5/32 SPPF Spatial Pyramid Pooling
  - [-1, 1, ETA, []] # 10 - P5/32 Enhanced Triple Attention Module

head:
  - [2, 1, FSFDown, [head_channel]] # 11 - P3/8 Frequency - Spatial Fusion Downsampling (P2竊単3)
  - [6, 1, Conv, [head_channel]] # 12 - P4/16 Feature adjustment
  - [10, 1, Conv, [head_channel]] # 13 - P5/32 Feature adjustment

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14 - P5竊単4 Upsampling
  - [[-1, 12], 1, Fusion, [fusion_mode]] # 15 - P4/16 BiFPN fusion
  - [-1, 3, C2f, [head_channel]] # 16 - P4/16 Feature enhancement

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 - P4竊単3 Upsampling
  - [[-1, 4, 11], 1, Fusion, [fusion_mode]] # 18 - P3/8 BiFPN fusion
  - [-1, 3, C2f, [head_channel]] # 19 - P3/8 Feature enhancement

  - [[-1, 4], 1, Fusion, [fusion_mode]] # 20 - P3/8 Bidirectional fusion
  - [-1, 3, C2f, [head_channel]] # 21 - P3/8 Feature enhancement

  - [-1, 1, Conv, [head_channel, 3, 2]] # 22 - P3竊単4 Downsampling
  - [[-1, 12, 16], 1, Fusion, [fusion_mode]] # 23 - P4/16 BiFPN fusion
  - [-1, 3, C2f, [head_channel]] # 24 - P4/16 Feature enhancement

  - [-1, 1, Conv, [head_channel, 3, 2]] # 25 - P4竊単5 Downsampling
  - [[-1, 13], 1, Fusion, [fusion_mode]] # 26 - P5/32 BiFPN fusion
  - [-1, 3, C2f, [head_channel]] # 27 - P5/32 Feature enhancement

  - [[21, 24, 27], 1, Detect, [nc]]  # Detect(P3, P4, P5) Final detection head
